Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/distance_selling.html.txt.tmx
Source language: en
Languages: ga

source: However, if you are contracted to a trader and receive unwanted books or CDs, you should check your contract as it may contain a term that commits you to receiving 4 or 5 items a year
ga: Má tá tú ar conradh le trádálaí agus má fhaigheann tú leabhair nó dlúthdhioscaí gan iarraidh, ba cheart duit do chonradh a sheiceáil mar gheall go bhféadfadh go gcuimsítear ann téarma a leagann dualgas ort 4 nó 5 earra sa bhliain a fháil

source: If this is the case, the trader's actions cannot be considered inertia selling
ga: Más amhlaidh an cás, ní féidir caitheamh le gníomhartha an trádálaí mar dhíol gan iarraidh

source: It is therefore very important for you to read the contract carefully before committing yourself to it
ga: Tá sé an-tábhachtach, ar an ábhar sin, go léann tú an conradh sula dtugann tú gealltanas dó

source: Waiving your rights as a consumer
ga: Do cheart mar thomhaltóir a tharscaoileadh

source: You cannot waive the rights conferred on you by the Consumer Rights Directive
ga: Ní féidir leat na cearta a bhronnann an Treoir maidir le Cearta Tomhaltóirí ort a tharscaoileadh

source: When making a complaint, you should firstly contact the trader and inform them of your complaint
ga: Nuair a bhíonn gearán á dhéanamh agat, ba cheart duit, ar an gcéad dul síos, teagmháil a dhéanamh leis an trádálaí agus iad a chur ar an eolas faoi do ghearán

source: If you are not satisfied with the response, you may be able to get help with your complaint
ga: Mura bhfuil tú sásta leis an bhfreagairt, d’fhéadfá bheith in ann cabhair a fháil le do ghearán

source: If your complaint is against a trader here in Ireland, then you should complain to the Competition and Consumer Protection Commission (CCPC), which has responsibility for enforcing the Regulations
ga: Má tá do ghearán i gcoinne trádálaí anseo in Éirinn, ba cheart duit an gearán a dhéanamh leis an gCoimisiún um Iomaíocht agus Cosaint Tomhaltóirí (an CICT), atá freagrach as na Rialacháin a fhorfheidhmiú

source: The CCPC can appoint officers to search, inspect and remove documents from the premises of offending traders
ga: Féadfaidh an CICT oifigigh a cheapadh chun cáipéisí a chuardach, a iniúchadh agus a bhaint ó áitreabh trádálaí ciontaithe

source: If a trader fails to comply with legal obligations, then the distance contract will be rendered unenforceable
ga: Má theipeann ar thrádálaí dualgais dhlíthiúla a chomhlíonadh, caithfear leis an gcianchonradh mar chonradh nach féidir a chur i bhfeidhm

source: The supplier is then exposed to the risk of criminal prosecution and fines of up to €60,000 or up to 18 months in prison, or to both
ga: Tá an soláthraí i mbaol ansin go gcúiseofar é/í agus go ngearrfar fíneálacha a mhéid le €60,000 air/uirthi nó go ngearrfar a fhad le18 mí sa phríosún air/uirthi, nó an dá rud

source: If the trader is in another EU member state, you can contact the European Consumer Centre Ireland (ECC Ireland) which is part of the European Consumer Centres Network (ECC-Net) and it may contact the trader and try to resolve your dispute
ga: Má tá an trádálaí i mballstát eile an AE, féadfaidh an trádálaí teagmháil a dhéanamh leis an Lárionad Eorpach do Thomhaltóirí (ECC Éireann) atá mar chuid de Líonra na Lárionad Eorpach do Thomhaltóirí (ECC-Net)

source: If appropriate, ECC Ireland may forward your case to an alternative dispute resolution (ADR) organisation in the other country
ga: Déanfaidh siad teagmháil leis an trádálaí agus déanfaidh siad iarracht do dhíospóid a réiteach

source: ADR should be considered, before legal action, as an opportunity to settle a dispute out of court, if your attempts to resolve the dispute directly with a trader proved unsuccessful
ga: Mura n-éiríonn leis seo, cuirfidh ECC Éireann do chás faoi bhráid eagraíocht Mhalartach chun Díospóidí a Réiteach (ADR) sa tír eile. Níor cheart ADR a úsáid ach mar rogha deiridh

source: You can get further information on ADR in the EU by contacting ECC Ireland
ga: Féadfaidh tú breis faisnéise a fháil ar ADR san AE trí theagmháil a dhéanamh le ECC Éireann

source: The online dispute resolution (ODR) Regulation (SI 500/2015) came into effect on 9 January 2016
ga: Tháinig in éifeacht ar an 9 Eanáir 2016 Rialachán um réiteach díospóidí ar líne (RDAL) (IR 500/2015)

source: A new online ODR platform developed and operated by the European Commission acts as a single point of contact for consumers and traders, within the EU, who seek to resolve disputes arising from online shopping
ga: Feidhmíonn clár nua RDAL, a rinne an Coimisiún Eorpach a fhorbairt agus a chur i bhfeidhm, mar phointe aonair teagmhála idir tomhaltóirí agus trádálaithe na hEorpa ar mhaith leo díospóidí a eascraíonn as siopadóireacht ar líne a réiteach

source: If the trader is based outside the EU, you can direct your complaint to Econsumer.gov after you have tried to solve the problem directly with the seller
ga: Má tá an trádálaí bunaithe lasmuigh den AE, féadfaidh tú do ghearán a chur faoi bhráid Econsumer.gov tar éis go ndearna tú iarracht an fhadhb a réiteach go díreach leis an díoltóir

source: Econsumer.gov also tries to protect consumers from internet scams
ga: Déanann Econsumer.gov iarracht tomhaltóirí a chosaint ó chamscéimeanna idirlín chomh maith

source: ECC Ireland has published a leaflet on online shopping (pdf)
ga: D’fhoilsigh ECC Éireann bileog ar shiopadóireacht idirlín (pdf)

source: The Competition and Consumer Protection Commission website contains information on buying online
ga: Cuimsítear ar láithreán gréasáin an Choimisiúin um Iomaíocht agus Cosaint Tomhaltóirí faisnéis ar cheannach ar líne
